[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {false}
 
         <Col md={6}>
killedBy: ReviewForm tests renders correctly when passing in a Review
statusReason: Error: Unable to find an element by: [data-testid="ReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:30:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
 
         <Col md={6}>
killedBy: ReviewForm tests renders correctly when passing in a Review
statusReason: Error: Unable to find an element by: [data-testid="ReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] BooleanLiteral
main/components/Review/ReviewForm.js:55:27
               type="text"
               isInvalid={Boolean(errors.studentId)}
               {...register("studentId", {
-                required: true,
+                required: false,
                 pattern: integer_regex,
               })}

[Killed] LogicalOperator
main/components/Review/ReviewForm.js:60:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.studentId && "Student ID is required"}
+              {errors.studentId || "Student ID is required"}
               {errors.studentId?.type === "pattern" &&
                 "Student ID must be a positive integer"}
killedBy: ReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Student ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="studentId"

[Survived] ConditionalExpression
main/components/Review/ReviewForm.js:60:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.studentId && "Student ID is required"}
+              {false}
               {errors.studentId?.type === "pattern" &&
                 "Student ID must be a positive integer"}

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:61:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.studentId && "Student ID is required"}
-              {errors.studentId?.type === "pattern" &&
-                "Student ID must be a positive integer"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Student ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:61:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.studentId && "Student ID is required"}
-              {errors.studentId?.type === "pattern" &&
-                "Student ID must be a positive integer"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: Error: Unable to find an element with the text: /Student ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] ConditionalExpression
main/components/Review/ReviewForm.js:81:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.itemId && "Item ID is required"}
+              {false}
               {errors.itemId?.type === "pattern" &&
                 "Item ID must be a positive integer"}

[Killed] LogicalOperator
main/components/Review/ReviewForm.js:82:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
-              {errors.itemId?.type === "pattern" &&
-                "Item ID must be a positive integer"}
+              {errors.itemId?.type === "pattern" || "Item ID must be a positive integer"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] EqualityOperator
main/components/Review/ReviewForm.js:82:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
-              {errors.itemId?.type === "pattern" &&
+              {errors.itemId?.type !== "pattern" &&
                 "Item ID must be a positive integer"}
             </Form.Control.Feedback>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/Review/ReviewForm.js:99:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateItemServed)}
               {...register("dateItemServed", {
-                required: true,
+                required: false,
                 pattern: isodate_regex,
               })}
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Item Served is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Review/ReviewForm.js:104:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateItemServed && "Date Item Served is required"}
+              {errors.dateItemServed || "Date Item Served is required"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:104:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.dateItemServed && "Date Item Served is required"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Item Served is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:126:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars must be between 1 and 5"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:126:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.stars && "Stars must be between 1 and 5"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Stars must be between 1 and 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Review/ReviewForm.js:142:40
               as="textarea"
               rows={3}
               isInvalid={Boolean(errors.comments)}
-              {...register("comments", {
-                required: true,
-                maxLength: 500,
-              })}
+              {...register("comments", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/Review/ReviewForm.js:148:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "Comments are required"}
+              {errors.comments || "Comments are required"}
               {errors.comments?.type === "maxLength" &&
                 "Comments cannot exceed 500 characters"}
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: Error: Objects are not valid as a React child (found: object with keys {type, message, ref}). If you meant to render a collection of children, use an array instead.

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:148:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.comments && "Comments are required"}
+              {true}
               {errors.comments?.type === "maxLength" &&
                 "Comments cannot exceed 500 characters"}
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Comments are required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] OptionalChaining
main/components/Review/ReviewForm.js:149:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.comments && "Comments are required"}
-              {errors.comments?.type === "maxLength" &&
+              {errors.comments.type === "maxLength" &&
                 "Comments cannot exceed 500 characters"}
             </Form.Control.Feedback>
killedBy: ReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'type')

[Survived] ConditionalExpression
main/components/Review/ReviewForm.js:149:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.comments && "Comments are required"}
-              {errors.comments?.type === "maxLength" &&
-                "Comments cannot exceed 500 characters"}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>

[Killed] StringLiteral
main/components/Review/ReviewForm.js:166:32
                   data-testid="ReviewForm-status"
                   id="status"
                   type="text"
-                  {...register("status")}
+                  {...register("")}
                   value={initialContents.status}
                   disabled
killedBy: ReviewForm tests renders correctly when passing in a Review
statusReason: TypeError: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Review/ReviewForm.js:197:32
                   id="moderatorComments"
                   as="textarea"
                   rows={3}
-                  {...register("moderatorComments")}
+                  {...register("")}
                   value={initialContents.moderatorComments}
                   disabled
killedBy: ReviewForm tests renders correctly when passing in a Review
statusReason: TypeError: Cannot read properties of undefined (reading '_f')
