[Killed] BooleanLiteral
main/components/Review/ReviewTable.js:18:22
 export default function ReviewTable({
   reviews,
   currentUser,
-  moderatorOptions = false,
+  moderatorOptions = true,
   deleteColumn = false,
 }) {
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-success" data-testid="ReviewTable-cell-row-0-col-Approve-button" type="button">Approve</button> instead

[Survived] BlockStatement
main/components/Review/ReviewTable.js:23:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/review/edit/${cell.row.values.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all: hard to test for query caching

[Survived] StringLiteral
main/components/Review/ReviewTable.js:24:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/review/edit/${cell.row.values.id}`);
+    navigate(``);
   };
 

[Killed] BlockStatement
main/components/Review/ReviewTable.js:53:43
     deleteMutation.mutate(cell);
   };
 
-  const approveCallback = async (cell) => {
-    approveMutation.mutate(cell);
-  };
+  const approveCallback = async (cell) => {};
 
   const rejectCallback = async (cell) => {
killedBy: ReviewTable tests Approve button calls approve callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Review/ReviewTable.js:57:42
     approveMutation.mutate(cell);
   };
 
-  const rejectCallback = async (cell) => {
-    rejectMutation.mutate(cell);
-  };
+  const rejectCallback = async (cell) => {};
 
   const columns = [
killedBy: ReviewTable tests Reject button calls reject callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:62:5
   };
 
   const columns = [
-    {
-      Header: "Id",
-      accessor: "id",
-    },
+    {},
     {
       Header: "Student ID",
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:83:15
       accessor: "status",
     },
     {
-      Header: "Moderator ID",
+      Header: "",
       accessor: "userIdModerator",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Moderator ID"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/Review/ReviewTable.js:95:15
       accessor: "dateCreated",
     },
     {
-      Header: "Date Edited",
+      Header: "",
       accessor: "dateEdited",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Date Edited"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] BlockStatement
main/components/Review/ReviewTable.js:100:25
     },
   ];
 
-  if (moderatorOptions) {
-    columns.push(
-      ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
-    );
-    columns.push(
-      ButtonColumn("Reject", "warning", rejectCallback, "ReviewTable"),
-    );
-  }
+  if (moderatorOptions) {}
 
   if (deleteColumn) {
killedBy: ReviewTable tests Has the expected column headers and content with moderator options and delete column
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Approve"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/Review/ReviewTable.js:102:59
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
+      ButtonColumn("Approve", "success", approveCallback, ""),
     );
     columns.push(
killedBy: ReviewTable tests Has the expected column headers and content with moderator options and delete column
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Approve-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] BlockStatement
main/components/Review/ReviewTable.js:109:21
     );
   }
 
-  if (deleteColumn) {
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "ReviewTable"),
-    );
-  }
+  if (deleteColumn) {}
 
   return (
killedBy: ReviewTable tests Has the expected column headers and content with moderator options and delete column
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Delete"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ConditionalExpression
main/components/Review/ReviewTable.js:109:7
     );
   }
 
-  if (deleteColumn) {
+  if (false) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "ReviewTable"),
killedBy: ReviewTable tests Has the expected column headers and content with moderator options and delete column
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Delete"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/Review/ReviewTable.js:116:56
   }
 
   return (
-    <OurTable data={reviews} columns={columns} testid={"ReviewTable"} />
+    <OurTable data={reviews} columns={columns} testid={""} />
   );
 }
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
