[Killed] BlockStatement
src/main/utils/ReviewUtils.js:23:47
 
 // Stryker restore all
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/review",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
 export function cellToAxiosParamsApprove(cell) {
killedBy: ReviewTable tests Delete button calls delete callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/ReviewUtils.js:33:48
   };
 }
 
-export function cellToAxiosParamsApprove(cell) {
-  return {
-    url: `/api/review/approve/${cell.row.values.id}`,
-    method: "POST",
-  };
-}
+export function cellToAxiosParamsApprove(cell) {}
 
 export function cellToAxiosParamsReject(cell) {
killedBy: ReviewTable tests Approve button calls approve callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/ReviewUtils.js:34:10
 }
 
 export function cellToAxiosParamsApprove(cell) {
-  return {
-    url: `/api/review/approve/${cell.row.values.id}`,
-    method: "POST",
-  };
+  return {};
 }
 
killedBy: ReviewTable tests Approve button calls approve callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
src/main/utils/ReviewUtils.js:40:47
   };
 }
 
-export function cellToAxiosParamsReject(cell) {
-  return {
-    url: `/api/review/reject/${cell.row.values.id}`,
-    method: "POST",
-  };
-}
+export function cellToAxiosParamsReject(cell) {}
 
killedBy: ReviewTable tests Reject button calls reject callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ObjectLiteral
src/main/utils/ReviewUtils.js:41:10
 }
 
 export function cellToAxiosParamsReject(cell) {
-  return {
-    url: `/api/review/reject/${cell.row.values.id}`,
-    method: "POST",
-  };
+  return {};
 }
 
killedBy: ReviewTable tests Reject button calls reject callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] StringLiteral
src/main/utils/ReviewUtils.js:42:10
 
 export function cellToAxiosParamsReject(cell) {
   return {
-    url: `/api/review/reject/${cell.row.values.id}`,
+    url: ``,
     method: "POST",
   };
killedBy: ReviewTable tests Reject button calls reject callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "/api/review/reject/1"
Received: ""

[Killed] StringLiteral
src/main/utils/ReviewUtils.js:43:13
 export function cellToAxiosParamsReject(cell) {
   return {
     url: `/api/review/reject/${cell.row.values.id}`,
-    method: "POST",
+    method: "",
   };
 }
killedBy: ReviewTable tests Reject button calls reject callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
