[Killed] LogicalOperator
main/components/Review/ReviewForm.js:26:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col md={6}>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="ReviewForm-id"
-                id="id"
-                type="text"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col md={6}>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="ReviewForm-id" id="id" type="text" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
 
         <Col md={6}>
killedBy: ReviewForm tests renders correctly
statusReason: TypeError: Cannot read properties of undefined (reading 'id')

[Survived] ConditionalExpression
main/components/Review/ReviewForm.js:56:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.studentId && "Student ID is required"}
+              {true}
               {errors.studentId?.type === "pattern" &&
                 "Student ID must be a positive integer"}

[Killed] EqualityOperator
main/components/Review/ReviewForm.js:57:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.studentId && "Student ID is required"}
-              {errors.studentId?.type === "pattern" &&
+              {errors.studentId?.type !== "pattern" &&
                 "Student ID must be a positive integer"}
             </Form.Control.Feedback>
killedBy: ReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Student ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="studentId"

[Killed] LogicalOperator
main/components/Review/ReviewForm.js:57:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.studentId && "Student ID is required"}
-              {errors.studentId?.type === "pattern" &&
-                "Student ID must be a positive integer"}
+              {errors.studentId?.type === "pattern" || "Student ID must be a positive integer"}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests renders correctly
statusReason: Error: Found multiple elements with the text: /Student ID/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="studentId"

[Killed] ConditionalExpression
main/components/Review/ReviewForm.js:78:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.itemId && "Item ID is required"}
-              {errors.itemId?.type === "pattern" &&
-                "Item ID must be a positive integer"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Item ID must be a positive integer/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/Review/ReviewForm.js:94:46
               id="dateItemServed"
               type="datetime-local"
               isInvalid={Boolean(errors.dateItemServed)}
-              {...register("dateItemServed", {
-                required: true,
-                pattern: isodate_regex,
-              })}
+              {...register("dateItemServed", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ReviewForm tests Correct error messages on bad input
statusReason: TestingLibraryElementError: Unable to find an element with the text: /Date Item Served is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Survived] EqualityOperator
main/components/Review/ReviewForm.js:145:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.comments && "Comments are required"}
-              {errors.comments?.type === "maxLength" &&
+              {errors.comments?.type !== "maxLength" &&
                 "Comments cannot exceed 500 characters"}
             </Form.Control.Feedback>
