[Killed] StringLiteral
main/components/Review/ReviewTable.js:74:15
       accessor: "itemId",
     },
     {
-      Header: "Date Item Served",
+      Header: "",
       accessor: "dateItemServed",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Date Item Served"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:81:5
       Header: "Status",
       accessor: "status",
     },
-    {
-      Header: "Moderator ID",
-      accessor: "userIdModerator",
-    },
+    {},
     {
       Header: "Moderator Comments",
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/Review/ReviewTable.js:89:5
       Header: "Moderator Comments",
       accessor: "moderatorComments",
     },
-    {
-      Header: "Date Created",
-      accessor: "dateCreated",
-    },
+    {},
     {
       Header: "Date Edited",
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Review/ReviewTable.js:90:15
       accessor: "moderatorComments",
     },
     {
-      Header: "Date Created",
+      Header: "",
       accessor: "dateCreated",
     },
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "columnheader" and name "Date Created"

Here are the accessible roles:

  table:

  Name "":
  <table

[Killed] StringLiteral
main/components/Review/ReviewTable.js:91:17
     },
     {
       Header: "Date Created",
-      accessor: "dateCreated",
+      accessor: "",
     },
     {
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-dateCreated"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Review/ReviewTable.js:104:57
       ButtonColumn("Approve", "success", approveCallback, "ReviewTable"),
     );
     columns.push(
-      ButtonColumn("Reject", "warning", rejectCallback, "ReviewTable"),
+      ButtonColumn("Reject", "warning", rejectCallback, ""),
     );
   }
killedBy: ReviewTable tests Has the expected column headers and content with moderator options and delete column
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="ReviewTable-cell-row-0-col-Reject-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ConditionalExpression
main/components/Review/ReviewTable.js:108:7
     );
   }
 
-  if (deleteColumn) {
+  if (true) {
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "ReviewTable"),
killedBy: ReviewTable tests Has the expected column headers and content for ordinary user
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="ReviewTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead
