[Killed] StringLiteral
src/main/utils/ReviewUtils.js:35:13
 export function cellToAxiosParamsApprove(cell) {
   return {
     url: `/api/review/approve/${cell.row.values.id}`,
-    method: "POST",
+    method: "",
   };
 }
killedBy: ReviewTable tests Approve button calls approve callback
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
