[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:10:20
 import { useBackendMutation } from "main/utils/useBackend";
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
-  const { root } = currentUser || {};
+  const { root } = false;
   const { user } = root || {};
   const { email, pictureUrl, fullName, alias: initialAlias } = user || {};
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ProfilePage.js:12:64
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
   const { user } = root || {};
-  const { email, pictureUrl, fullName, alias: initialAlias } = user || {};
+  const { email, pictureUrl, fullName, alias: initialAlias } = user && {};
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'email' of '(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:12:64
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
   const { user } = root || {};
-  const { email, pictureUrl, fullName, alias: initialAlias } = user || {};
+  const { email, pictureUrl, fullName, alias: initialAlias } = false;
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
