[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:41:7
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
-  if (!currentUser?.loggedIn) {
+  if (true) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Not logged in.
    </p>

[Killed] OptionalChaining
src/main/pages/ProfilePage.js:41:8
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
-  if (!currentUser?.loggedIn) {
+  if (!currentUser.loggedIn) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests displays 'Not logged in' for unauthenticated user
statusReason: TypeError: Cannot read properties of undefined (reading 'loggedIn')

[Survived] ConditionalExpression
src/main/pages/ProfilePage.js:49:7
   };
 
   const { isSuccess } = mutation;
-  if (isSuccess) {
+  if (true) {
     window.location.reload();
   }

[Survived] BlockStatement
src/main/pages/ProfilePage.js:49:18
   };
 
   const { isSuccess } = mutation;
-  if (isSuccess) {
-    window.location.reload();
-  }
+  if (isSuccess) {}
 
   return (

[Killed] StringLiteral
src/main/pages/ProfilePage.js:94:16
               type="submit"
               disabled={mutation.isLoading}
             >
-              {"Update Alias"}
+              {""}
             </Button>
           </Form>
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: TestingLibraryElementError: Unable to find an element with the text: Update Alias. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
