[Killed] StringLiteral
main/components/Users/UsersTable.js:27:9
   },
   {
     Header: "Alias",
-    id: "alias",
+    id: "",
     accessor: (row) => (row.alias === null ? "Anonymous User" : row.alias),
   },
killedBy: UserTable tests Has the expected colum headers and content
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="UsersTable-cell-row-0-col-alias"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] ArrowFunction
main/components/Users/UsersTable.js:28:15
   {
     Header: "Alias",
     id: "alias",
-    accessor: (row) => (row.alias === null ? "Anonymous User" : row.alias),
+    accessor: () => undefined,
   },
   {
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/components/Users/UsersTable.js:28:25
   {
     Header: "Alias",
     id: "alias",
-    accessor: (row) => (row.alias === null ? "Anonymous User" : row.alias),
+    accessor: (row) => (false ? "Anonymous User" : row.alias),
   },
   {
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/components/Users/UsersTable.js:30:3
     id: "alias",
     accessor: (row) => (row.alias === null ? "Anonymous User" : row.alias),
   },
-  {
-    Header: "Proposed Alias",
-    accessor: "proposedAlias",
-  },
+  {},
   {
     Header: "Status",
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: A column ID (or string accessor) is required!

[Killed] LogicalOperator
main/components/Users/UsersTable.js:37:11
   {
     Header: "Status",
     accessor: (row) => {
-      if (row.status === "Approved" && row.dateApproved) {
+      if (row.status === "Approved" || row.dateApproved) {
         const formattedDate = new Date(row.dateApproved).toLocaleDateString();
         return `Approved on ${formattedDate}`;
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Found multiple elements with the text: Approved on 10/31/2024

Here are the matching elements:

Ignored nodes: comments, script, style
<td
  data-testid="UsersTable-cell-row-0-col-Status"
  role="cell"
