[Killed] LogicalOperator
src/main/pages/ProfilePage.js:12:20
 
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
-  const { root } = currentUser || {};
+  const { root } = currentUser && {};
   const { user } = root || {};
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:12:20
 
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
-  const { root } = currentUser || {};
+  const { root } = true;
   const { user } = root || {};
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:13:20
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
-  const { user } = root || {};
+  const { user } = false;
   const {
     email,
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:13:20
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
-  const { user } = root || {};
+  const { user } = true;
   const {
     email,
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:21:7
     alias: _initialAlias,
     _proposedAlias,
     _status,
-  } = user || {};
+  } = false;
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
src/main/pages/ProfilePage.js:21:7
     alias: _initialAlias,
     _proposedAlias,
     _status,
-  } = user || {};
+  } = user && {};
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'email' of '(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:29:42
     handleSubmit,
   } = useForm();
 
-  const objectToAxiosParams = (user) => ({
-    url: "/api/currentUser/updateAlias",
-    method: "POST",
-    params: {
-      proposedAlias: user.proposedAlias,
-    },
-  });
+  const objectToAxiosParams = (user) => ({});
   const onSuccess = (user) => {
     toast(`Alias Awaiting Moderation: ${user.proposedAlias}`);
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewAlias"
Received
       1: "Axios Error: Error: Request failed with status code 404"
       2: "Error: Request failed with status code 404"

Number of calls: 2

[Killed] StringLiteral
src/main/pages/ProfilePage.js:37:11
     },
   });
   const onSuccess = (user) => {
-    toast(`Alias Awaiting Moderation: ${user.proposedAlias}`);
+    toast(``);
   };
 
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewAlias"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] OptionalChaining
src/main/pages/ProfilePage.js:45:8
     { onSuccess },
     "current user",
   );
-  if (!currentUser?.loggedIn) {
+  if (!currentUser.loggedIn) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests displays 'Not logged in' for unauthenticated user
statusReason: TypeError: Cannot read properties of undefined (reading 'loggedIn')

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:45:7
     { onSuccess },
     "current user",
   );
-  if (!currentUser?.loggedIn) {
+  if (false) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'user')

[Killed] BlockStatement
src/main/pages/ProfilePage.js:48:36
   if (!currentUser?.loggedIn) {
     return <p>Not logged in.</p>;
   }
-  const onSubmit = async (data) => {
-    mutation.mutate({ proposedAlias: data.alias });
-  };
+  const onSubmit = async (data) => {};
 
   return (
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Alias Awaiting Moderation: NewAlias"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ArrayDeclaration
src/main/pages/ProfilePage.js:54:26
 
   return (
     <BasicLayout>
-      <UsersTable users={[currentUser.root.user]} />
+      <UsersTable users={[]} />
       <Row className="align-items-center profile-header mb-5 text-center text-md-left">
         <Col md={2}>
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:78:39
               <Form.Label>Alias</Form.Label>
               <Form.Control
                 type="text"
-                {...register("alias", {
-                  required: "Alias is required.",
-                })}
+                {...register("alias", {})}
                 isInvalid={Boolean(errors.alias)}
                 placeholder="Enter your new alias"
killedBy: ProfilePage tests displays validation error when alias is empty
statusReason: Error: Unable to find an element with the text: Alias is required.. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
