[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:32:7
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
-  if (!currentUser?.loggedIn) {
+  if (false) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'user' of 'root' as it is null.

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:32:7
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
 
-  if (!currentUser?.loggedIn) {
+  if (true) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <p>
      Not logged in.
    </p>

[Killed] LogicalOperator
src/main/pages/ProfilePage.js:56:26
     window.location.reload();
   }
 
-  const displayedAlias = initialAlias || "Anonymous User";
+  const displayedAlias = initialAlias && "Anonymous User";
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:59:5
   const displayedAlias = initialAlias || "Anonymous User";
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
-    status === "Approved"
+    true
       ? " New alias now displayed."
       : status === "Rejected"
killedBy: ProfilePage tests displays alias when rejected
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
