[Killed] LogicalOperator
src/main/pages/ProfilePage.js:12:20
 const ProfilePage = () => {
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
-  const { user } = root || {};
+  const { user } = root && {};
   const { email, pictureUrl, fullName, alias: initialAlias, proposedAlias, status } = user || {};
 
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'user' of '(intermediate value)(intermediate value)(intermediate value)' as it is null.

[Killed] LogicalOperator
src/main/pages/ProfilePage.js:13:87
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
   const { user } = root || {};
-  const { email, pictureUrl, fullName, alias: initialAlias, proposedAlias, status } = user || {};
+  const { email, pictureUrl, fullName, alias: initialAlias, proposedAlias, status } = user && {};
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot destructure property 'email' of '(intermediate value)(intermediate value)(intermediate value)' as it is undefined.

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:13:87
   const { data: currentUser } = useCurrentUser();
   const { root } = currentUser || {};
   const { user } = root || {};
-  const { email, pictureUrl, fullName, alias: initialAlias, proposedAlias, status } = user || {};
+  const { email, pictureUrl, fullName, alias: initialAlias, proposedAlias, status } = false;
 
   const {
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: Error: Unable to find an element with the text: Phillip Conrad. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
src/main/pages/ProfilePage.js:24:13
   const objectToAxiosParams = (user) => ({
     url: "/api/currentUser/updateAlias",
     method: "POST",
-    params: {
-      proposedAlias: user.proposedAlias,
-    },
+    params: {},
   });
   const onSuccess = (user) => {
killedBy: ProfilePage tests handles alias submission successfully and sends correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 3
+ Received  + 1

- Object {
-   "proposedAlias": "NewAlias",
- }

[Killed] BooleanLiteral
src/main/pages/ProfilePage.js:33:7
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
-  if (!currentUser?.loggedIn) {
+  if (currentUser?.loggedIn) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'roles')

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:33:7
   };
 
   const mutation = useBackendMutation(objectToAxiosParams, { onSuccess });
-  if (!currentUser?.loggedIn) {
+  if (false) {
     return <p>Not logged in.</p>;
   }
killedBy: ProfilePage tests renders correctly for regular logged in user
statusReason: TypeError: Cannot read properties of null (reading 'roles')

[Survived] ConditionalExpression
src/main/pages/ProfilePage.js:41:7
   };
 
   const { isSuccess } = mutation;
-  if (isSuccess) {
+  if (false) {
     window.location.reload();
   }

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:45:26
     window.location.reload();
   }
 
-  const displayedAlias = initialAlias || "Anonymous User";
+  const displayedAlias = false;
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:45:26
     window.location.reload();
   }
 
-  const displayedAlias = initialAlias || "Anonymous User";
+  const displayedAlias = true;
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
killedBy: ProfilePage tests displays initial alias correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Anonymous User. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:46:34
   }
 
   const displayedAlias = initialAlias || "Anonymous User";
-  const displayedProposedAlias = proposedAlias || "---";
+  const displayedProposedAlias = true;
   const aliasTag =
     status === "Approved"
killedBy: ProfilePage tests displays alias when approved
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:46:34
   }
 
   const displayedAlias = initialAlias || "Anonymous User";
-  const displayedProposedAlias = proposedAlias || "---";
+  const displayedProposedAlias = false;
   const aliasTag =
     status === "Approved"
killedBy: ProfilePage tests displays alias when approved
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/ProfilePage.js:48:5
   const displayedAlias = initialAlias || "Anonymous User";
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
-    status === "Approved"
+    status !== "Approved"
       ? " New alias now displayed."
       : status === "Rejected"
killedBy: ProfilePage tests displays alias when approved
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:48:5
   const displayedAlias = initialAlias || "Anonymous User";
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
-    status === "Approved"
+    false
       ? " New alias now displayed."
       : status === "Rejected"
killedBy: ProfilePage tests displays alias when approved
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
src/main/pages/ProfilePage.js:49:9
   const displayedProposedAlias = proposedAlias || "---";
   const aliasTag =
     status === "Approved"
-      ? " New alias now displayed."
+      ? ""
       : status === "Rejected"
       ? " Please try a different alias."
killedBy: ProfilePage tests displays alias when approved
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
src/main/pages/ProfilePage.js:50:9
   const aliasTag =
     status === "Approved"
       ? " New alias now displayed."
-      : status === "Rejected"
+      : status !== "Rejected"
       ? " Please try a different alias."
       : ""; 
killedBy: ProfilePage tests displays alias when rejected
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
src/main/pages/ProfilePage.js:50:9
   const aliasTag =
     status === "Approved"
       ? " New alias now displayed."
-      : status === "Rejected"
+      : false
       ? " Please try a different alias."
       : ""; 
killedBy: ProfilePage tests displays alias when rejected
statusReason: 
Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
